# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

text = input("Enter info ... ")
str_text = (text.split())

for ind, el in enumerate(str_text, 1):
    print(ind, el[:10])
