# Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
# Каждый кортеж хранит информацию об отдельном товаре.
# В кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара: название, цена,
# количество, единица измерения). Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.

goods_count = input("Количество товаров: ")
goods = []
dict_analysis = {"название": [], "цена": [], "количество": [], "единица измерения": []}

i = 1
while i <= int(goods_count):
    my_dict = {"название": input("название: "), "цена": input("цена: "), "количество": input("количество: "),
               "единица измерения": input("единица измерения: ")}
    print("Следующий товар ... ")
    temp_goods = [i, my_dict]
    goods.append(tuple(temp_goods))
    dict_analysis.setdefault("название", []).append(my_dict.get("название"))
    dict_analysis.setdefault("цена", []).append(my_dict.get("цена"))
    dict_analysis.setdefault("количество", []).append(my_dict.get("количество"))
    dict_analysis.setdefault("единица измерения", []).append(my_dict.get("единица измерения"))
    i += 1

print(goods)
print(dict_analysis)
